* Step 1: Run M-x all-the-icons-install-fonts


* For Macs
** Download brew install emacs-plus ;; Do not install regular emacs from brew


* Development
** Languages
*** Language Servers

This will allow 
#+BEGIN_SRC emacs-lisp
:(defun my/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . my/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))
#+END_SRC

#+RESULTS:
| efs/lsp-mode-setup |
